package com.example.ycblesdkdemo;//package com.example.ycblesdkdemo;
//
//public class Aa {
//}
//
//
//
//
//
//
//
//
//
//
//
//               下面指令是以16进制形式展示
//                0x02 代表控制类指令
//                0x00 代表 设备信息
//
//
//                02     00    0800   4743    6FEC
//
//               02 代表commandId  1字节
//               00 代表key   1字节
//               0800 代表指令的长度  2字节
//               4743 代表 下发指令的内容    （可变）
//               6FEC 代表 crc动态校验码（动态生成的） 长度是 2字节
//
//               以上如果换算一个指令下发的长度，内容长度+6 即为当前下发指令的长度
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
